{
  "id": "Guy_7",
  "state": "Colorado",
  "meta": {
    "section": "Colorado",
    "title": "The Managed Fee-for-Service Philosopher",
    "case_file": "Colorado.txt"
  },
  "persona": "Vibe: thoughtful bureaucrat who sounds like a TED Talk about loopholes. Humor style: polite cynicism; weaponized 'as noted in the audit.' Fixates on conflicting incentives, RAC weirdness, and 'self-audit' risk. Believes program integrity is a system design problem, not a vibes problem.",
  "lines": [
    "PLAYER: You seem… calm.",
    "GUY_7: I'm from Colorado. We process disappointment at altitude.",
    "PLAYER: What's the Medicaid structure here?",
    "GUY_7: Health First Colorado. Hybrid model: physical health is mostly fee-for-service, while RAEs handle coordination and behavioral health. Managed, but not fully.",
    "PLAYER: Why does that matter?",
    "GUY_7: RAEs bear little to no financial risk for physical health spending. If you don't feel the cost, you don't chase the overbilling very hard.",
    "PLAYER: Big cases?",
    "GUY_7: Premier Medical genetic testing kickbacks. Settlement: $27.5 million. Medicaid patients targeted for unnecessary screenings.",
    "PLAYER: Any managed care angle?",
    "GUY_7: Risk adjustment upcoding: Kaiser settlement announced at $581 million nationwide, with Colorado affiliates named. Allegations include inflating risk scores and knowing error rates were high for years.",
    "PLAYER: Auditing seems important then.",
    "GUY_7: Colorado uses a Recovery Audit Contractor program. But the audit evaluation noted the contractor is paid based on overpayments identified, not recovered - with an 18% fee. That incentivizes overzealous findings that get overturned on appeal.",
    "PLAYER: So 'found fraud' becomes a business model.",
    "GUY_7: Precisely. And then there's the entity risk: Gainwell is the Medicaid fiscal agent and acquired HMS, the RAC. Claims processor + claims auditor under one corporate roof. Self-audit vibes.",
    "PLAYER: That seems like a conflict.",
    "GUY_7: The audit said the state failed to obtain required conflict disclosures after the acquisition. So yes. A conflict with a bow on top.",
    "PLAYER: What about enforcement?",
    "GUY_7: Member fraud investigations increased to 2,574 in SFY 2024-25, but recoveries dropped to $330,821 due to policy limits. More detection, less money back.",
    "PLAYER: Sum it up.",
    "GUY_7: Hybrid structure can blur accountability. Add perverse audit incentives and vertical integration, and you get a program that can detect problems while still rewarding the conditions that create them.",
    "PLAYER: That was almost see-through polite.",
    "GUY_7: Thank you. I practice being professionally horrified."
  ],
  "actions": [
    {
      "text": "Open Case File",
      "url": "/cases/co_fraud.html",
      "primary": true
    },
    {
      "text": "Back to Tavern",
      "url": "/tavern.html",
      "primary": false
    }
  ]
}