{
  "id": "Guy_6",
  "state": "Florida",
  "meta": {
    "section": "Florida",
    "title": "The Kickback Tour Guide",
    "case_file": "Florida.txt"
  },
  "persona": "Vibe: sunny delivery, grim details. A walking 'welcome brochure' for corruption. Humor style: tourist-guide sarcasm ('and on your left, felony'). Deep on SMMC privatization, NEMT subcontracting, and pharma influence. Suspicious of 'internal investigations' and loves quoting CMS findings.",
  "lines": [
    "PLAYER: Florida. You look… cheerful.",
    "GUY_6: That's how Florida gets you. Sunshine outside, felony inside.",
    "PLAYER: What's Florida's system like?",
    "GUY_6: Statewide Medicaid Managed Care. Mandatory managed care, over 5 million beneficiaries, 16 MCOs. Lots of subcontractors.",
    "PLAYER: Sounds complex.",
    "GUY_6: Complex enough to hide a marching band.",
    "PLAYER: Big fraud stories?",
    "GUY_6: 2025 national takedown in South Florida: 37 defendants, $14.6 billion in alleged fraud.",
    "PLAYER: That's… insane.",
    "GUY_6: Case example: Newtech Medical Supply billed $2.9 million for DME that never showed up. Ghost equipment. Very on-brand.",
    "PLAYER: Any corporate-level stuff?",
    "GUY_6: Gilead settlement: over $3 million to resolve allegations of kickbacks to push high-cost HIV drugs like Biktarvy and Genvoya via meals, travel, awards.",
    "PLAYER: 'Educational dinners.'",
    "GUY_6: Exactly. The syllabus is shrimp.",
    "PLAYER: Provider scams?",
    "GUY_6: PSR fraud: a Miami operation recruited patients with kickbacks to attend unnecessary services, billed over $1.2 million.",
    "PLAYER: Where does managed care fail?",
    "GUY_6: CMS review in 2025 said Florida's MCOs lacked a formal procedure to refer potential fraud to law enforcement, which violates federal requirements.",
    "PLAYER: So MCOs can just… keep it internal.",
    "GUY_6: They can 'investigate' and quietly move on. Also, service verification exists on paper, but the state doesn't require regular reporting of those verification results.",
    "PLAYER: And transportation?",
    "GUY_6: NEMT is a classic. Subcontracting fragments the data trail. Ghost trips. Deadhead miles. Enough paperwork to paper-mache a boat.",
    "PLAYER: Sum up Florida.",
    "GUY_6: Aggressive privatization, huge money, subcontractor layers, and referral bottlenecks. Great weather for fraud. Bring sunscreen and a subpoena.",
    "PLAYER: You're kind of funny.",
    "GUY_6: I'm not funny. I'm traumatized with good timing."
  ],
  "actions": [
    {
      "text": "Open Case File",
      "url": "/cases/fl_fraud.html",
      "primary": true
    },
    {
      "text": "Back to Tavern",
      "url": "/tavern.html",
      "primary": false
    }
  ]
}